{"kind":"books#volume","id":"rk9sAQAAQBAJ","etag":"iQX2okGL3BI","selfLink":"https://www.googleapis.com/books/v1/volumes/rk9sAQAAQBAJ","volumeInfo":{"title":"Practical Object-oriented Design in Ruby","subtitle":"An Agile Primer","authors":["Sandi Metz"],"publisher":"Pearson Education","publishedDate":"2013","description":"The Complete Guide to Writing More Maintainable, Manageable, Pleasing, and Powerful Ruby Applications Ruby's widely admired ease of use has a downside: Too many Ruby and Rails applications have been created without concern for their long-term maintenance or evolution. The Web is awash in Ruby code that is now virtually impossible to change or extend. This text helps you solve that problem by using powerful real-world object-oriented design techniques, which it thoroughly explains using simple and practical Ruby examples. Sandi Metz has distilled a lifetime of conversations and presentations about object-oriented design into a set of Ruby-focused practices for crafting manageable, extensible, and pleasing code. She shows you how to build new applications that can survive success and repair existing applications that have become impossible to change. Each technique is illustrated with extended examples, all downloadable from the companion Web site,poodr.info. The first title to focus squarely on object-oriented Ruby application design, Practical Object-Oriented Design in Ruby will guide you to superior outcomes, whatever your previous Ruby experience. Novice Ruby programmers will find specific rules to live by; intermediate Ruby programmers will find valuable principles they can flexibly interpret and apply; and advanced Ruby programmers will find a common language they can use to lead development and guide their colleagues. This guide will help you Understand how object-oriented programming can help you craft Ruby code that is easier to maintain and upgrade Decide what belongs in a single Ruby class Avoid entangling objects that should be kept separate Define flexible interfaces among objects Reduce programming overhead costs with duck typing Successfully apply inheritance Build objects via composition Design cost-effective tests Solve common problems associated with poorly designed Ruby code","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780321721334"},{"type":"ISBN_10","identifier":"0321721330"}],"readingModes":{"text":false,"image":true},"pageCount":247,"printType":"BOOK","categories":["Computers"],"averageRating":5,"ratingsCount":1,"maturityRating":"NOT_MATURE","allowAnonLogging":false,"contentVersion":"0.2.0.0.preview.1","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=rk9sAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=rk9sAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=rk9sAQAAQBAJ&printsec=frontcover&dq=Practical+Object-Oriented+Design:+An+Agile+Primer+Using+Ruby&hl=&cd=1&source=gbs_api","infoLink":"http://books.google.com/books?id=rk9sAQAAQBAJ&dq=Practical+Object-Oriented+Design:+An+Agile+Primer+Using+Ruby&hl=&source=gbs_api","canonicalVolumeLink":"https://books.google.com/books/about/Practical_Object_oriented_Design_in_Ruby.html?hl=&id=rk9sAQAAQBAJ"},"saleInfo":{"country":"US","saleability":"NOT_FOR_SALE","isEbook":false},"accessInfo":{"country":"US","viewability":"PARTIAL","embeddable":true,"publicDomain":false,"textToSpeechPermission":"ALLOWED_FOR_ACCESSIBILITY","epub":{"isAvailable":false},"pdf":{"isAvailable":false},"webReaderLink":"http://play.google.com/books/reader?id=rk9sAQAAQBAJ&hl=&printsec=frontcover&source=gbs_api","accessViewStatus":"SAMPLE","quoteSharingAllowed":false},"searchInfo":{"textSnippet":"This guide will help you Understand how object-oriented programming can help you craft Ruby code that is easier to maintain and upgrade Decide what belongs in a single Ruby class Avoid entangling objects that should be kept separate Define ..."}}