{"kind":"books#volume","id":"u6q0cXjJVj4C","etag":"Vrz5JySIZaY","selfLink":"https://www.googleapis.com/books/v1/volumes/u6q0cXjJVj4C","volumeInfo":{"title":"Death of Lucifer: The Grace of the Atlantis Race (The 3rd Book of the FAUSTEF TRILOGY)","authors":["V. Alexander Stefan"],"publisher":"Stefan University Press","publishedDate":"2007","description":"Prologue Part I The Morning 1.1. Eternity: QUALB to Faustef of SELF 1.2. Eternity: QUALB to Faustef of Giving 1.3. Great Sphinx of Giza: Exodus I 1.4. The Prometheus Mortals 1.5. Lilith, the Evil Woman 1.6. The Trismegistus Mortals 1.7. QUALB and Abraham of Babylon 1.8. Faustef Visiting Marie Louise Bromfield. Part II The Noon 2.1. The Wiping Out of the Milky Way Galaxy 2.2. Atlahtze from Andromeda Galaxy in the Fight Against Lucifer 2.3. Oooja and Ooorooja: Lucifer’s “5th Colony” in the Council-11 2.4. Eternity: QUALB to Faustef of Creation and Harmony 2.5. The Rise and the Fall of the Republic of Downia 2.6. All Lucifer’s Men 2.7 Doctor Faustef Hits the Big Time. Part III The Dusk 3.1. Lucifer’s Message to Etznobai 3.2. Faustef and Etznobai Solve the Problem of the Time-knot-13 3.3. Einstein and Trismes at the Area 51 3.4. Eternity: QUALB to Faustef of Believers and Nonbelievers 3.5. Shairah, Faustef’s Incarnation in the 31st Century 3.6 Faustef Meets Zorkah, Evila’s Incarnation in the 22nd Century 3.7. Eternity: QUALB to Faustef of Gold and Diamonds. Part IV The Evening 4.1. Lucifer Steals Code-13 from Faustef 4. 2. Lucifer, an Escapee from the Time Prison 4.3. Lucifer, a Dirty Racist 4.4. Eternity: QUALB to Faustef of the Everlasting; of Mortals; of Immortals 4.5. The “Wolfpack of Brooklyn” 4.6. The Galactic War of the Snakes 4.7. Mrgood the Orionide 4.8. Carlsbad Cave, Mrgood’s Home 4.9. Mrgood and She-wolf of Rome 4.10. Mrgood and Sweet Fatima of Arabia 4.11. Mrgood and Plato and Faustef 4.12. The Gilgamesh Syndrome. Part V The Night 5.1. Badonna Spotting Faustef in the Classroom 5.2. The Faustef Immortals in the Fight Against Lucifer 5.3. Professor Marcadam 5.4. Paradigms in the Physics of Time from Orpheus to Faustef 5.5. Faustef’s Theory on Psychoton and Noeton Particles 5.6. Eternity: QUALB to Faustef of Invention and Discovery 5.7. Eternity: QUALB to Faustef of Qualb-Code 5.8. Psychonoetic Scintillation at the Center of Our Milky Way Galaxy 5.9. Sagittario Black Hole: The Soul of Milky Way Galaxy 5.10. The Game of Endurance in Psychonoetic Sex 5.11. The Goethe Game of Colors. Part VI The Midnight 6.1. The Absolute Death of Lucifer in Atlantis Universe 6.2. Lucifer on the Trial at the QUALB Court of Time 6.3. The Vote 6.4. Eternity: QUALB to Faustef of the Trismegistus Mortals 6.5. Evila Abducted by Lucifer 6.6. Faustef Walking Through the Continents with QUALB the Giver 6.7. Faustef and Marilyn Monroe: A Pillow Talk 6.8. Dark Is in Gargantua Black Hole. Part VII The Dawn 7.1. The Execution of Lucifer 7.2. Etznobai Becomes the Member of the Council -11 7.3. Etznobai Will Be Mine, Says Lucifer 7.4. Eternity: QUALB to Faustef of Woman and Man 7.5. Faustef Welcoming the 4th Millennium 7.6. The 3700s A.D., the Century of Exodus II 7.7. Orion Nebula: Our Home, Our Very Own 7.8. Earth and Oztl Planet 7.9. Laahn-Ishtar of Milky Way Galaxy and Arhaap of Andromeda Galaxy 7.10. Laahn-Ishtar and Lucifer 7. 11 Wrath of Lucifer: The Cataclysm of Milky Way and Andromeda Galaxy 7. 12 The Boomsday: Milky Way and Andromeda Galaxy Collide 7. 13. Earth Facing the Boomsday 7. 14. The Whole Creation Facing the Boomsday 7. 15. It’s the Boomsday in Atlantis Universe 7.16. A Lucifer-free Atlantis Universe 7. 17.Good Luck to Faustef. Epilogue","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781889545813"},{"type":"ISBN_10","identifier":"1889545813"}],"readingModes":{"text":true,"image":true},"printType":"BOOK","categories":["Atlantis (Legendary place)"],"maturityRating":"NOT_MATURE","allowAnonLogging":false,"contentVersion":"3.3.4.0.preview.3","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=u6q0cXjJVj4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=u6q0cXjJVj4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=u6q0cXjJVj4C&pg=PA12&dq=Lucifer+VII:+Exodus&hl=&cd=2&source=gbs_api","infoLink":"https://play.google.com/store/books/details?id=u6q0cXjJVj4C&source=gbs_api","canonicalVolumeLink":"https://play.google.com/store/books/details?id=u6q0cXjJVj4C"},"saleInfo":{"country":"US","saleability":"FOR_SALE","isEbook":true,"listPrice":{"amount":21.95,"currencyCode":"USD"},"retailPrice":{"amount":13.17,"currencyCode":"USD"},"buyLink":"https://play.google.com/store/books/details?id=u6q0cXjJVj4C&rdid=book-u6q0cXjJVj4C&rdot=1&source=gbs_api","offers":[{"finskyOfferType":1,"listPrice":{"amountInMicros":21950000,"currencyCode":"USD"},"retailPrice":{"amountInMicros":13170000,"currencyCode":"USD"},"giftable":true}]},"accessInfo":{"country":"US","viewability":"PARTIAL","embeddable":true,"publicDomain":false,"textToSpeechPermission":"ALLOWED","epub":{"isAvailable":true,"acsTokenLink":"http://books.google.com/books/download/Death_of_Lucifer_The_Grace_of_the_Atlant-sample-epub.acsm?id=u6q0cXjJVj4C&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"},"pdf":{"isAvailable":true,"acsTokenLink":"http://books.google.com/books/download/Death_of_Lucifer_The_Grace_of_the_Atlant-sample-pdf.acsm?id=u6q0cXjJVj4C&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"},"webReaderLink":"http://play.google.com/books/reader?id=u6q0cXjJVj4C&hl=&printsec=frontcover&source=gbs_api","accessViewStatus":"SAMPLE","quoteSharingAllowed":false},"searchInfo":{"textSnippet":"Etznobai Will Be Mine, Says <b>Lucifer</b>.......201 7.4. Eternity: QUALB to Faustef of <br>\nWoman and Man......................................................................................204 7.5. Faustef <br>\nWelcoming the 4th Millennium..205 7.6. The 3700s A.D. The Century of <b>Exodus</b> II <br>\n."}}