{"kind":"books#volume","id":"EoxXLiC0uAIC","etag":"vpL1Gw6vcpE","selfLink":"https://www.googleapis.com/books/v1/volumes/EoxXLiC0uAIC","volumeInfo":{"title":"Cloud Atlas","authors":["David Mitchell"],"publisher":"Vintage Canada","publishedDate":"2010-07-16","description":"By the New York Times bestselling author of The Bone Clocks | Shortlisted for the Man Booker Prize A postmodern visionary and one of the leading voices in twenty-first-century fiction, David Mitchell combines flat-out adventure, a Nabokovian love of puzzles, a keen eye for character, and a taste for mind-bending, philosophical and scientific speculation in the tradition of Umberto Eco, Haruki Murakami, and Philip K. Dick. The result is brilliantly original fiction as profound as it is playful. In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity. Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . . Abruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history. But the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky. As wild as a videogame, as mysterious as a Zen koan, Cloud Atlas is an unforgettable tour de force that, like its incomparable author, has transcended its cult classic status to become a worldwide phenomenon. Praise for Cloud Atlas “[David] Mitchell is, clearly, a genius. He writes as though at the helm of some perpetual dream machine, can evidently do anything, and his ambition is written in magma across this novel’s every page.”—The New York Times Book Review “One of those how-the-holy-hell-did-he-do-it? modern classics that no doubt is—and should be—read by any student of contemporary literature.”—Dave Eggers “Wildly entertaining . . . a head rush, both action-packed and chillingly ruminative.”—People “The novel as series of nested dolls or Chinese boxes, a puzzle-book, and yet—not just dazzling, amusing, or clever but heartbreaking and passionate, too. I’ve never read anything quite like it, and I’m grateful to have lived, for a while, in all its many worlds.”—Michael Chabon “Cloud Atlas ought to make [Mitchell] famous on both sides of the Atlantic as a writer whose fearlessness is matched by his talent.”—The Washington Post Book World “Thrilling . . . One of the biggest joys in Cloud Atlas is watching Mitchell sashay from genre to genre without a hitch in his dance step.”—Boston Sunday Globe “Grand and elaborate . . . [Mitchell] creates a world and language at once foreign and strange, yet strikingly familiar and intimate.”—Los Angeles Times From the Hardcover edition.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780307373571"},{"type":"ISBN_10","identifier":"0307373576"}],"readingModes":{"text":true,"image":false},"pageCount":528,"printType":"BOOK","categories":["Fiction"],"averageRating":4,"ratingsCount":337,"maturityRating":"NOT_MATURE","allowAnonLogging":true,"contentVersion":"0.1.0.0.preview.2","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=EoxXLiC0uAIC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=EoxXLiC0uAIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=EoxXLiC0uAIC&printsec=frontcover&dq=Cloud+Atlas&hl=&cd=1&source=gbs_api","infoLink":"http://books.google.com/books?id=EoxXLiC0uAIC&dq=Cloud+Atlas&hl=&source=gbs_api","canonicalVolumeLink":"https://books.google.com/books/about/Cloud_Atlas.html?hl=&id=EoxXLiC0uAIC"},"saleInfo":{"country":"US","saleability":"NOT_FOR_SALE","isEbook":false},"accessInfo":{"country":"US","viewability":"PARTIAL","embeddable":true,"publicDomain":false,"textToSpeechPermission":"ALLOWED_FOR_ACCESSIBILITY","epub":{"isAvailable":true,"acsTokenLink":"http://books.google.com/books/download/Cloud_Atlas-sample-epub.acsm?id=EoxXLiC0uAIC&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"},"pdf":{"isAvailable":false},"webReaderLink":"http://play.google.com/books/reader?id=EoxXLiC0uAIC&hl=&printsec=frontcover&source=gbs_api","accessViewStatus":"SAMPLE","quoteSharingAllowed":false},"searchInfo":{"textSnippet":"In this groundbreaking novel, an influential favorite among a new generation of writers, Mitchell explores with daring artistry fundamental questions of reality and identity."}}