{"kind":"books#volume","id":"PpEz47zsLEwC","etag":"8EzG1vCY2DM","selfLink":"https://www.googleapis.com/books/v1/volumes/PpEz47zsLEwC","volumeInfo":{"title":"Ender's Shadow","authors":["Orson Scott Card"],"publisher":"Macmillan","publishedDate":"2002-05-19","description":"Orson Scott Card brings us back to the very beginning of his brilliant Ender Quartet, with the novel that begins The Shadow Series and allows us to reenter Ender's world anew. With all the power of his original creation, Ender's Shadow is Card's parallel volume to Ender's Game, a book that expands and complements the first, enhancing its power, illuminating its events and its powerful conclusion. The human race is at War with the \"Buggers\", an insect-like alien race. The first battles went badly, and now as Earth prepares to defend itself against the imminent threat of total destruction at the hands of an inscrutable alien enemy, all focus is on the development and training of military geniuses who can fight such a war, and win. The long distances of interstellar space have given hope to the defenders of Earth--they have time to train these future commanders up from childhood, forging then into an irresistible force in the high orbital facility called the Battle School. Andrew \"Ender\" Wiggin was not the only child in the Battle School; he was just the best of the best. In this new book, card tells the story of another of those precocious generals, the one they called Bean--the one who became Ender's right hand, part of his team, in the final battle against the Buggers. Bean's past was a battle just to survive. He first appeared on the streets of Rotterdam, a tiny child with a mind leagues beyond anyone else's. He knew he could not survive through strength; he used his tactical genius to gain acceptance into a children's gang, and then to help make that gang a template for success for all the others. He civilized them, and lived to grow older. Bean's desperate struggle to live, and his success, brought him to the attention of the Battle School's recruiters, those people scouring the planet for leaders, tacticians, and generals to save Earth from the threat of alien invasion. Bean was sent into orbit, to the Battle School. And there he met Ender.... THE ENDER UNIVERSE Ender series Ender’s Game / Ender in Exile / Speaker for the Dead / Xenocide / Children of the Mind Ender’s Shadow series Ender’s Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in Flight Children of the Fleet The First Formic War (with Aaron Johnston) Earth Unaware / Earth Afire / Earth Awakens The Second Formic War (with Aaron Johnston) The Swarm /The Hive Ender novellas A War of Gifts /First Meetings At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1429963980"},{"type":"ISBN_13","identifier":"9781429963985"}],"readingModes":{"text":true,"image":false},"pageCount":384,"printType":"BOOK","categories":["Fiction"],"averageRating":4,"ratingsCount":211,"maturityRating":"NOT_MATURE","allowAnonLogging":true,"contentVersion":"2.15.14.0.preview.2","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=PpEz47zsLEwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=PpEz47zsLEwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=PpEz47zsLEwC&printsec=frontcover&dq=Ender%27s+Shadow&hl=&cd=1&source=gbs_api","infoLink":"https://play.google.com/store/books/details?id=PpEz47zsLEwC&source=gbs_api","canonicalVolumeLink":"https://play.google.com/store/books/details?id=PpEz47zsLEwC"},"saleInfo":{"country":"US","saleability":"FOR_SALE","isEbook":true,"listPrice":{"amount":8.99,"currencyCode":"USD"},"retailPrice":{"amount":8.99,"currencyCode":"USD"},"buyLink":"https://play.google.com/store/books/details?id=PpEz47zsLEwC&rdid=book-PpEz47zsLEwC&rdot=1&source=gbs_api","offers":[{"finskyOfferType":1,"listPrice":{"amountInMicros":8990000,"currencyCode":"USD"},"retailPrice":{"amountInMicros":8990000,"currencyCode":"USD"},"giftable":true}]},"accessInfo":{"country":"US","viewability":"PARTIAL","embeddable":true,"publicDomain":false,"textToSpeechPermission":"ALLOWED","epub":{"isAvailable":true},"pdf":{"isAvailable":false},"webReaderLink":"http://play.google.com/books/reader?id=PpEz47zsLEwC&hl=&printsec=frontcover&source=gbs_api","accessViewStatus":"SAMPLE","quoteSharingAllowed":false},"searchInfo":{"textSnippet":"Orson Scott Card brings us back to the very beginning of his brilliant Ender Quartet, with the novel that begins The Shadow Series and allows us to reenter Ender&#39;s world anew."}}