{"kind":"books#volume","id":"HEfBBAAAQBAJ","etag":"w/Tt5tJonU4","selfLink":"https://www.googleapis.com/books/v1/volumes/HEfBBAAAQBAJ","volumeInfo":{"title":"Panzerkrieg","subtitle":"The Rise and Fall of Hitler's Tank Divisions","authors":["Mike Syron"],"publisher":"Constable","publishedDate":"2013-02-07","description":"For many people the very image of Blitzkrieg is of massed columns of tanks sweeping through Europe, smashing all resistance and leaving a trail of devastation in their wake. Indeed, it was the Panzers' achievements in battle that were largely responsible for Germany's early run of success in the Second World War and, once the tide of war began to turn against the Reich, the Panzers subsequently became the backbone of its defence. The dramatic story of Hitler's tank divisions is brought to life in this authoritative narrative. Panzerkrieg vividly describes the evolution, exploits and eventual destruction of this superlative fighting force in immensely readable fashion. Particularly accessible to the general reader who wants to know more about Germany's Second World War tank forces, the authors dispense with technical jargon and pedantic detail to give a comprehensive overview of all aspects of the subject, both human and technical. The book gives particular emphasis to the men who fought in and led the Panzer divisions: great generals like Guderian, Rommel and Manstein, tank masters like Wittmann and Bake, and inspired commanders like Balck and Bayerlein. The whole vast canvas of the war emerges from this narrative, as it follows the titanic struggles which ranged between the bocage country of France, the desert wastes of North Africa, and the limitless steppes of Russia. The evolution of German fighting vehicles and tactics is fully charted, and the many myths, fallacies and misconceptions that have grown up around the Panzerwaffe are exploded. Extensive research, reference to the memoirs of the leading participants, and original new conclusions all contribute to a comprehensive account that critically examines the achievements, failures, and ultimate legacy of the Panzer divisions. Features INCLUDE: The secret pre-war birth and development of the Panzerwaffe The lightning campaigns in Poland and France The four bloody years of the Russian campaign, the greatest clash of arms the world has ever seen The exploits of Rommel and his Africa Corps Hitler's increasingly disastrous influence on the Panzerwaffe Disputes between the Panzer officers and their High Command Portraits of the Panzerwaffe's leaders Detailed analysis of the great tank battles such as Kursk and the Battle of the Bulge, with clear maps Comparative rank and organizational charts Information on the technical evolution of Germany's armoured fighting vehicles, including the development of the mighty Tigers and Panthers Unique sections on uniforms, crew functions and how German tanks were built Rare coverage of how the Panzer leaders fared after the war The legacy of the Panzers","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781472107800"},{"type":"ISBN_10","identifier":"1472107802"}],"readingModes":{"text":true,"image":false},"pageCount":160,"printType":"BOOK","categories":["History"],"averageRating":3,"ratingsCount":1,"maturityRating":"NOT_MATURE","allowAnonLogging":false,"contentVersion":"1.1.1.0.preview.2","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=HEfBBAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=HEfBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=HEfBBAAAQBAJ&printsec=frontcover&dq=Panzerkreig&hl=&cd=1&source=gbs_api","infoLink":"https://play.google.com/store/books/details?id=HEfBBAAAQBAJ&source=gbs_api","canonicalVolumeLink":"https://play.google.com/store/books/details?id=HEfBBAAAQBAJ"},"saleInfo":{"country":"US","saleability":"FOR_SALE","isEbook":true,"listPrice":{"amount":3.99,"currencyCode":"USD"},"retailPrice":{"amount":3.99,"currencyCode":"USD"},"buyLink":"https://play.google.com/store/books/details?id=HEfBBAAAQBAJ&rdid=book-HEfBBAAAQBAJ&rdot=1&source=gbs_api","offers":[{"finskyOfferType":1,"listPrice":{"amountInMicros":3990000,"currencyCode":"USD"},"retailPrice":{"amountInMicros":3990000,"currencyCode":"USD"},"giftable":true}]},"accessInfo":{"country":"US","viewability":"PARTIAL","embeddable":true,"publicDomain":false,"textToSpeechPermission":"ALLOWED","epub":{"isAvailable":true,"acsTokenLink":"http://books.google.com/books/download/Panzerkrieg-sample-epub.acsm?id=HEfBBAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"},"pdf":{"isAvailable":false},"webReaderLink":"http://play.google.com/books/reader?id=HEfBBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api","accessViewStatus":"SAMPLE","quoteSharingAllowed":false},"searchInfo":{"textSnippet":"The book gives particular emphasis to the men who fought in and led the Panzer divisions: great generals like Guderian, Rommel and Manstein, tank masters like Wittmann and Bake, and inspired commanders like Balck and Bayerlein."}}