{"kind":"books#volume","id":"UqccAgAAQBAJ","etag":"3PJyPuZo8S8","selfLink":"https://www.googleapis.com/books/v1/volumes/UqccAgAAQBAJ","volumeInfo":{"title":"Creativity, Inc.","subtitle":"Overcoming the Unseen Forces That Stand in the Way of True Inspiration","authors":["Ed Catmull","Amy Wallace"],"publisher":"Random House","publishedDate":"2014-04-08","description":"NEW YORK TIMES BESTSELLER | NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The Huffington Post • Financial Times • Success • Inc. • Library Journal From Ed Catmull, co-founder (with Steve Jobs and John Lasseter) of Pixar Animation Studios, the Academy Award–winning studio behind Inside Out and Toy Story, comes an incisive book about creativity in business and leadership—sure to appeal to readers of Daniel Pink, Tom Peters, and Chip and Dan Heath. Fast Company raves that Creativity, Inc. “just might be the most thoughtful management book ever.” Creativity, Inc. is a book for managers who want to lead their employees to new heights, a manual for anyone who strives for originality, and the first-ever, all-access trip into the nerve center of Pixar Animation—into the meetings, postmortems, and “Braintrust” sessions where some of the most successful films in history are made. It is, at heart, a book about how to build a creative culture—but it is also, as Pixar co-founder and president Ed Catmull writes, “an expression of the ideas that I believe make the best in us possible.” For nearly twenty years, Pixar has dominated the world of animation, producing such beloved films as the Toy Story trilogy, Monsters, Inc., Finding Nemo, The Incredibles, Up, WALL-E, and Inside Out, which have gone on to set box-office records and garner thirty Academy Awards. The joyousness of the storytelling, the inventive plots, the emotional authenticity: In some ways, Pixar movies are an object lesson in what creativity really is. Here, in this book, Catmull reveals the ideals and techniques that have made Pixar so widely admired—and so profitable. As a young man, Ed Catmull had a dream: to make the first computer-animated movie. He nurtured that dream as a Ph.D. student at the University of Utah, where many computer science pioneers got their start, and then forged a partnership with George Lucas that led, indirectly, to his founding Pixar with Steve Jobs and John Lasseter in 1986. Nine years later, Toy Story was released, changing animation forever. The essential ingredient in that movie’s success—and in the thirteen movies that followed—was the unique environment that Catmull and his colleagues built at Pixar, based on leadership and management philosophies that protect the creative process and defy convention, such as: • Give a good idea to a mediocre team, and they will screw it up. But give a mediocre idea to a great team, and they will either fix it or come up with something better. • If you don’t strive to uncover what is unseen and understand its nature, you will be ill prepared to lead. • It’s not the manager’s job to prevent risks. It’s the manager’s job to make it safe for others to take them. • The cost of preventing errors is often far greater than the cost of fixing them. • A company’s communication structure should not mirror its organizational structure. Everybody should be able to talk to anybody. Praise for Creativity, Inc. “Over more than thirty years, Ed Catmull has developed methods to root out and destroy the barriers to creativity, to marry creativity to the pursuit of excellence, and, most impressive, to sustain a culture of disciplined creativity during setbacks and success.”—Jim Collins, co-author of Built to Last and author of Good to Great “Too often, we seek to keep the status quo working. This is a book about breaking it.”—Seth Godin From the Hardcover edition.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780679644507"},{"type":"ISBN_10","identifier":"0679644504"}],"readingModes":{"text":true,"image":false},"pageCount":368,"printType":"BOOK","categories":["Business & Economics"],"averageRating":4,"ratingsCount":33,"maturityRating":"NOT_MATURE","allowAnonLogging":true,"contentVersion":"1.7.7.0.preview.2","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=UqccAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=UqccAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=UqccAgAAQBAJ&printsec=frontcover&dq=Creativity,+Inc:+Overcoming+the+Unseen+Forces+That+Stand+in+the+Way+of+True+Inspiration&hl=&cd=1&source=gbs_api","infoLink":"https://play.google.com/store/books/details?id=UqccAgAAQBAJ&source=gbs_api","canonicalVolumeLink":"https://play.google.com/store/books/details?id=UqccAgAAQBAJ"},"saleInfo":{"country":"US","saleability":"FOR_SALE","isEbook":true,"listPrice":{"amount":9.99,"currencyCode":"USD"},"retailPrice":{"amount":9.99,"currencyCode":"USD"},"buyLink":"https://play.google.com/store/books/details?id=UqccAgAAQBAJ&rdid=book-UqccAgAAQBAJ&rdot=1&source=gbs_api","offers":[{"finskyOfferType":1,"listPrice":{"amountInMicros":9990000,"currencyCode":"USD"},"retailPrice":{"amountInMicros":9990000,"currencyCode":"USD"},"giftable":true}]},"accessInfo":{"country":"US","viewability":"PARTIAL","embeddable":true,"publicDomain":false,"textToSpeechPermission":"ALLOWED_FOR_ACCESSIBILITY","epub":{"isAvailable":true,"acsTokenLink":"http://books.google.com/books/download/Creativity_Inc-sample-epub.acsm?id=UqccAgAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"},"pdf":{"isAvailable":false},"webReaderLink":"http://play.google.com/books/reader?id=UqccAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api","accessViewStatus":"SAMPLE","quoteSharingAllowed":false},"searchInfo":{"textSnippet":"Here, in this book, Catmull reveals the ideals and techniques that have made Pixar so widely admired—and so profitable. As a young man, Ed Catmull had a dream: to make the first computer-animated movie."}}